<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uploads signed PKG and sets symlinks</string>
	<key>Identifier</key>
	<string>com.github.paul-suh-recipes.upload.AdobeFlashPlayer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AdobeAIR</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.pkg.FlashPlayerExtractPackage</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DateTimeTagger</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>ScpUploader</string>
			<key>Arguments</key>
			<dict>
                <key>dest_server</key>
                <string>transpak.mspex.net</string>
                <key>dest_path</key>
                <string>/var/local/www/transpak.mspex.net/htdocs</string>
                <key>dest_username</key>
                <string>locadmin</string>
            </dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgBasenameExtractor</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>SshCommandRunner</string>
			<key>Arguments</key>
			<dict>
				<key>remote_command</key>
				<string>/var/local/www/transpak.mspex.net/bin/update_one_link.sh</string>
				<key>argv</key>
				<string>%pkg_basename%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
