<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest RoyalTSX disk image and builds a package.</string>
    <key>Identifier</key>
    <string>com.github.paul-suh-recipes.signing.RoyalTSX</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>RoyalTSX</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.paul-suh-recipes.pkg.RoyalTSX</string>
    <key>Process</key>
    <array>
        <dict>
        	<key>Processor</key>
        	<string>PkgSigner</string>
        	<key>Arguments</key>
        	<dict>
        		<key>signing_cert</key>
        		<string>Developer ID Installer: ps Enable, Inc. (CC4C75F33Y)</string>
        		<key>suffix_with_date</key>
        		<true/>
        	</dict>
        </dict>
    </array>
</dict>
</plist>
